CSI API ETABS v1
cFrameObj.DeleteLoadPoint Method
 Deletes the point load assignments to the specified frame objects for the specified load pattern.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int DeleteLoadPoint(
	string Name,
	string LoadPat,
	eItemType ItemType = eItemType.Objects
)
Function DeleteLoadPoint (
	Name As String,
	LoadPat As String,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim LoadPat As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.DeleteLoadPoint(Name,
	LoadPat, ItemType)
int DeleteLoadPoint(
	String^ Name,
	String^ LoadPat,
	eItemType ItemType = eItemType::Objects
)
abstract DeleteLoadPoint :
        Name : string *
        LoadPat : string *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group depending on the value of the ItemType item.
LoadPat
Type: System.String
 The name of a defined load pattern.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the load assignments are deleted for the frame object specified by the Name item.
 If this item is Group, the load assignments are deleted for all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the load assignments are deleted for all selected frame objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the load assignments are successfully deleted, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'assign frame point loads
   ret = SapModel.FrameObj.SetLoadPoint("14", "DEAD", 1, 10, .5, 20)
   ret = SapModel.FrameObj.SetLoadPoint("15", "DEAD", 1, 10, .5, 20)
'delete frame point load
   ret = SapModel.FrameObj.DeleteLoadPoint("14", "DEAD")
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace